Revit 2027 API
ParameterTypeId.StructuralAttachmentTopRatio Property
 "Top Attachment Ratio"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentTopRatio { get; }
Public Shared ReadOnly Property StructuralAttachmentTopRatio As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentTopRatio {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentTopRatio : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace